export interface locationType {
    [location: string]: location
}

interface coordsType {
    lat: number
    lng: number
}

interface location {
    [location: string]: coordsType
}

const locations: locationType = {
    "서울": {
        "전체": {
            lat: 37.56661,
            lng: 126.9783882
        },
        "종로구": {
            lat: 37.5735207,
            lng: 126.9788345
        },
        "중구": {
            lat: 37.563843,
            lng: 126.997602
        },
        "용산구": {
            lat: 37.532527,
            lng: 126.99049
        },
        "성동구": {
            lat: 37.563456,
            lng: 127.036821
        },
        "광진구": {
            lat: 37.538617,
            lng: 127.082375
        },
        "동대문구": {
            lat: 37.574524,
            lng: 127.03965
        },
        "중랑구": {
            lat: 37.6063242,
            lng: 127.0925842
        },
        "성북구": {
            lat: 37.5894,
            lng: 127.016749
        },
        "강북구": {
            lat: 37.6397819,
            lng: 127.0256135
        },
        "도봉구": {
            lat: 37.668768,
            lng: 127.047163
        },
        "노원구": {
            lat: 37.654358,
            lng: 127.056473
        },
        "은평구": {
            lat: 37.602784,
            lng: 126.929164
        },
        "서대문구": {
            lat: 37.579225,
            lng: 126.9368
        },
        "마포구": {
            lat: 37.5663245,
            lng: 126.901491
        },
        "양천구": {
            lat: 37.517016,
            lng: 126.866642
        },
        "강서구": {
            lat: 37.550937,
            lng: 126.849642
        },
        "구로구": {
            lat: 37.495472,
            lng: 126.887536
        },
        "금천구": {
            lat: 37.4568644,
            lng: 126.8955105
        },
        "영등포구": {
            lat: 37.526436,
            lng: 126.896004
        },
        "동작구": {
            lat: 37.51245,
            lng: 126.9395
        },
        "관악구": {
            lat: 37.4781549,
            lng: 126.9514847
        },
        "서초구": {
            lat: 37.483569,
            lng: 127.032598
        },
        "강남구": {
            lat: 37.517305,
            lng: 127.047502
        },
        "송파구": {
            lat: 37.5145636,
            lng: 127.1059186
        },
        "강동구": {
            lat: 37.530126,
            lng: 127.1237708
        },
    }
}

const locations1: any = [
    // {
    //     location: "부산",
    //     subLocation: ["전체", "중구", "서구", "동구", "영도구", "부산진구", "동래구", "남구", "북구", "해운대구", "사하구", "금정구", "강서구", "연제구", "수영구", "사상구", "기장군"]
    // },
    // {
    //     location: "대구",
    //     subLocation: ["전체", "중구", "동구", "서구", "남구", "북구", "수성구", "달서구", "달성군"]
    // },
    // {
    //     location: "인천",
    //     subLocation: ["전체", "중구", "동구", "남구", "미추홀구", "연수구", "남동구", "부평구", "계양구", "서구", "강화군", "옹진군"]
    // },
    // {
    //     location: "광주",
    //     subLocation: ["전체", "동구", "서구", "남구", "북구", "광산구"]
    // },
    // {
    //     location: "대전",
    //     subLocation: ["전체", "동구", "중구", "서구", "유성구", "대덕구"]
    // },
    // {
    //     location: "울산",
    //     subLocation: ["전체", "중구", "남구", "동구", "북구", "울주군"]
    // },
    // {
    //     location: "세종"
    // },
    // {
    //     location: "경기",
    //     subLocation: ["전체", "수원시", "성남시", "고양시", "용인시", "부천시", "안산시", "안양시", "남양주시", "화성시", "평택시", "의정부시", "시흥시", "파주시", "광명시", "김포시", "군포시", "광주시", "이천시", "양주시", "오산시", "구리시", "안성시", "포천시", "의왕시", "하남시", "여주시", "여주군", "양평군", "동두천시", "과천시", "가평군", "연천군"]
    // },
    // {
    //     location: "강원",
    //     subLocation: ["전체", "춘천시", "원주시", "강릉시", "동해시", "태백시", "속초시", "삼척시", "홍천군", "횡성군", "영월군", "평창군", "정선군", "철원군", "화천군", "양구군", "인제군", "고성군", "양양군"]
    // },
    // {
    //     location: "충북",
    //     subLocation: ["전체", "청주시", "충주시", "제천시", "청원군", "보은군", "옥천군", "영동군", "진천군", "괴산군", "음성군", "단양군", "증평군"]
    // },
    // {
    //     location: "충남",
    //     subLocation: ["전체", "천안시", "공주시", "보령시", "아산시", "서산시", "논산시", "계룡시", "당진시", "당진군", "금산군", "연기군", "부여군", "서천군", "청양군", "홍성군", "예산군", "태안군"]
    // },
    // {
    //     location: "전북",
    //     subLocation: ["전체", "전주시", "군산시", "익산시", "정읍시", "남원시", "김제시", "완주군", "진안군", "무주군", "장수군", "임실군", "순창군", "고창군", "부안군"]
    // },
    // {
    //     location: "전남",
    //     subLocation: ["전체", "목포시", "여수시", "순천시", "나주시", "광양시", "담양군", "곡성군", "구례군", "고흥군", "보성군", "화순군", "장흥군", "강진군", "해남군", "영암군", "무안군", "함평군", "영광군", "장성군", "완도군", "진도군", "신안군"]
    // },
    // {
    //     location: "경북",
    //     subLocation: ["전체", "포항시", "경주시", "김천시", "안동시", "구미시", "영주시", "영천시", "상주시", "문경시", "경산시", "군위군", "의성군", "청송군", "영양군", "영덕군", "청도군", "고령군", "성주군", "칠곡군", "예천군", "봉화군", "울진군", "울릉군"]
    // },
    // {
    //     location: "경남",
    //     subLocation: ["전체", "창원시", "마산시", "진주시", "진해시", "통영시", "사천시", "김해시", "밀양시", "거제시", "양산시", "의령군", "함안군", "창녕군", "고성군", "남해군", "하동군", "산청군", "함양군", "거창군", "합천군"]
    // },
    // {
    //     location: "제주",
    //     subLocation: ["전체", "제주시", "서귀포시", "북제주군", "남제주군"]
    // }
]

export {
    locations
}